vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32660.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32660</name>
   <url>https://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32660 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>                  <!-- YYYY-MM-DD -->
      <release version="1.5.0" date="2023-05-04">
      	- Releasing Keil Pack File for MSDK, Updated Libraries and Examples
      </release> 
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32660</keyword>
      <keyword>MAX32660 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32660 family" Dvendor="Maxim:23"> <!-- FAISAL REMOVE THE EXTRA CHIP -->
         <book name="Doc/MAX32660_datasheet.txt" title="MAX32660 Family Data Sheet"/>
         <book name="Doc/MAX32660_userguide.txt" title="MAX32660 Family Users Guide"/>         
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32660/Include/max32660.h" />
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32660/Include/max32660.h" define="MAX32660"/>
         <memory name="IROM1" access="rx" start="0x00000000" size="0x00080000" startup="1" default="1"/>
         <memory name="IRAM1" access="rwx" start="0x20000000" size="0x00020000" init="0" default="1"/>
         <algorithm name="Flash/MAX32660.FLM" start="0x00000000" size="0x00080000" default="1"/>
         <algorithm  name="FlashIAR/FlashMAX32660.flash" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00020000" default="0" style="IAR"/>
         <description>
                In the DARWIN family, the MAX32660 is an ultra-low-power, cost-effective, highly-integrated 
				32-bit microcontroller designed for battery-powered devices and wireless sensors. It combines 
				a flexible and versatile power management unit with the powerful Arm® Cortex®-M4 processor
                with floating point unit (FPU) in the industry’s smallest form factor: 1.6mm x 1.6mm, 16-bump WLP 
				or 4mm x 4mm, 20-pin TQFN-EP, or 3mm x 3mm, 24-pin TQFN-EP. The MAX32660 enables designs with 
				complex sensor processing without compromising battery life. It also offers legacy designs an 
				easy and cost optimal upgrade path from 8- or 16-bit microcontrollers. The device supports SPI, 
				UART, and I2C communication while also integrating up to 256KB of flash memory and 96KB of RAM 
				to accommodate application and sensor code. An optional bootloader through I2C, UART, or SPI is
                available.		
         </description>     
     <!--    <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/> -->
         <!--<debug svd="SVD/MAX32660/MAX32660.svd" /> DELETE -->
		 <debug svd="Libraries/CMSIS/Device/Maxim/MAX32660/Include/max32660.svd" version="1.5.0" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32660">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>
<!--		 
         <device Dname="MAX32656">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
            <feature type="Crypto" n="128.256" name="HW Accelerated Trust Protection Unit"/>
         </device>		 
-->		 
      </family>
   </devices>

   <!-- MAX32660 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32660 EvKit" salesContact="sales@maximintegrated.com">
         <description>The MAX32660 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32660 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32660_EvKit.txt" title="MAX32660 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32660_EvKitSchematic.txt" title="MAX32660 EvKit Schematic"/>
    <!--     <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/> 
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32656"/> -->
		 <mountedDevice Dvendor="Maxim:23" Dname="MAX32660"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>
  
   <!-- Evaluation Kit Example Programs -->
      
   <examples>
   	  
