vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32660.pdsc
      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Examples/MAX32660/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hello_World.ewp" />
			<environment name="uv" load="ARM/Hello_World.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  

      <example name="DMA" doc="ARM/Abstract.txt" folder="Examples/MAX32660/DMA">
         <description>DMA Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--   <environment name="iar" load="IAR/DMA.ewp" />  -->
			<environment name="uv" load="ARM/DMA.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="Flash" doc="ARM/Abstract.txt" folder="Examples/MAX32660/Flash">
         <description>Flash Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/Flash.ewp" />  -->
			<environment name="uv" load="ARM/Flash.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	

      <example name="GPIO" doc="ARM/Abstract.txt" folder="Examples/MAX32660/GPIO">
         <description>GPIO Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/GPIO.ewp" />  -->
			<environment name="uv" load="ARM/GPIO.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="I2C" doc="ARM/Abstract.txt" folder="Examples/MAX32660/I2C">
         <description>I2C Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/I2C.ewp" />  -->
			<environment name="uv" load="ARM/I2C.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="I2S" doc="ARM/Abstract.txt" folder="Examples/MAX32660/I2S">
         <description>I2S Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/I2S.ewp" />  -->
			<environment name="uv" load="ARM/I2S.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="ICC" doc="ARM/Abstract.txt" folder="Examples/MAX32660/ICC">
         <description>ICC Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/ICC.ewp" />  -->
			<environment name="uv" load="ARM/ICC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="LP" doc="ARM/Abstract.txt" folder="Examples/MAX32660/LP">
         <description>LP Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/LP.ewp" />  -->
			<environment name="uv" load="ARM/LP.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="RTC" doc="ARM/Abstract.txt" folder="Examples/MAX32660/RTC">
         <description>RTC Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/RTC.ewp" />  -->
			<environment name="uv" load="ARM/RTC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="SPI" doc="ARM/Abstract.txt" folder="Examples/MAX32660/SPI">
         <description>SPI Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/SPI.ewp" />  -->
			<environment name="uv" load="ARM/SPI.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="SPIMSS" doc="ARM/Abstract.txt" folder="Examples/MAX32660/SPIMSS">
         <description>SPIMSS Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/SPIMSS.ewp" />  -->
			<environment name="uv" load="ARM/SPIMSS.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="SPI_MasterSlave" doc="ARM/Abstract.txt" folder="Examples/MAX32660/SPI_MasterSlave">
         <description>SPI_MasterSlave Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/SPI_MasterSlave.ewp" />  -->
			<environment name="uv" load="ARM/SPI_MasterSlave.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

