vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32660.pdsc
 <!--     <example name="Temp_Monitor" doc="ARM/Abstract.txt" folder="Examples/MAX32660/Temp_Monitor">
         <description>Temp_Monitor Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Temp_Monitor.ewp" />
		    <environment name="uv" load="ARM/Temp_Monitor.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> -->

      <example name="TMR" doc="ARM/Abstract.txt" folder="Examples/MAX32660/TMR">
         <description>TMR Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/TMR.ewp" />  -->
			<environment name="uv" load="ARM/TMR.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="UART" doc="ARM/Abstract.txt" folder="Examples/MAX32660/UART">
         <description>UART Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/UART.ewp" />  -->
			<environment name="uv" load="ARM/UART.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="UART_Wakeup" doc="ARM/Abstract.txt" folder="Examples/MAX32660/UART_Wakeup">
         <description>UART_Wakeup Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/UART_Wakeup.ewp" />  -->
			<environment name="uv" load="ARM/UART_Wakeup.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Examples/MAX32660/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32660 EvKit" vendor="Maxim"/>
         <project>
        <!--       <environment name="iar" load="IAR/Watchdog.ewp" />  -->
			<environment name="uv" load="ARM/Watchdog.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32660 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32660 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

   </examples>

   <conditions>
      <!-- MAX32660 Device Condition -->
      <condition id="MAX32660 Family">
         <description> Maxim Integrated MAX32660 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX32660"/>
      </condition>

      <!-- MAX32660 Device Condition -->
      <condition id="MAX32660 Device">
         <description> Maxim Integrated MAX32660 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32660"/>
      </condition>

      <!-- MAX32656 Device Condition -->
<!--      <condition id="MAX32656 Device">
         <description> Maxim Integrated MAX32660 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32656"/>
      </condition> -->

      <!-- MAX32660/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32660 CMSIS-CORE">
         <description>Maxim MAX32660 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32660 Family"/>
<!--         <accept condition="MAX32656 Device"/> -->
		 <accept condition="MAX32660 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <!-- ADC Peripheral Condition -->
      <condition id="MAX32660 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
	  
      <!-- TFT Peripheral Condition -->
      <condition id="MAX32660 CMSIS TFT">
         <description>TFT Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	  

      <!-- AES Peripheral Condition -->
      <condition id="MAX32660 CMSIS AES">
         <description>AES Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
	  
      <!-- CRC Peripheral Condition -->
      <condition id="MAX32660 CMSIS CRC">
         <description>CRC</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	

      <!-- CAMERAIF Peripheral -->
      <condition id="MAX32660 CMSIS CAMERAIF">
         <description>Standard CAMERAIF</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
	
      <!-- Standard DMA Peripheral -->
      <condition id="MAX32660 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	  

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32660 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require condition="MAX32660 CMSIS ICC"/>
      </condition>

