vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32660.pdsc
      <!-- GPIO -->
      <condition id="MAX32660 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32660 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32660 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32660 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
	  
      <!-- OWM -->
      <condition id="MAX32660 CMSIS OWM">
         <description>1-Wire Master Demo</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	  

      <!-- Low Power -->
      <condition id="MAX32660 CMSIS Low Power">
         <description>Low Power Demo</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- Low Power Comparator -->
      <condition id="MAX32660 CMSIS Low Power Comparator">
         <description>Low Power Comparator Demo</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>



      <!-- RTC -->
      <condition id="MAX32660 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32660 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
	  
      <!-- SPIMSS Peripheral -->
      <condition id="MAX32660 CMSIS SPIMSS">
         <description>SPIMSS Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	  

      <!-- SEMA Peripheral -->
      <condition id="MAX32660 CMSIS SEMA">
         <description>SEMA Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- SYS -->
      <condition id="MAX32660 CMSIS SYS">
         <description>SYS Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32660 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- TRNG -->
      <condition id="MAX32660 CMSIS TRNG">
         <description>Timers</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32660 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32660 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
	  
      <!-- WUT -->
      <condition id="MAX32660 CMSIS WUT">
         <description>Wakeup Timer</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	 

      <!-- PT -->
      <condition id="MAX32660 CMSIS PT">
         <description>Pulse Train</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>	  

      <!-- SDHC -->
      <condition id="MAX32660 CMSIS SDHC">
         <description>SDHC Demo</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <!-- CSI2 -->
      <condition id="MAX32660 CMSIS CSI2">
         <description>CSI2 Demo</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>


      <!-- SIMO -->
<!--	  
      <condition id="MAX32660 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>
-->
      <condition id="MAX32660 BSP DEP">	  
	     <description>Board Support Package</description>
         <!-- <require condition="MAX32660 CMSIS-CORE"/> -->
         <accept condition="MAX32660 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
	  
   </conditions>	  

   <components>
       <!--                                                                         
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.5.0" versionMatchMode="fixed" condition="MAX32660 Family">
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32660   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
       </component>
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="1.5.0" condition="MAX32660 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32660   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component> -->



      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="1.5.0">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

         <!-- MAX32660 Device Selection -->
         <component Cgroup="Startup" Cversion="1.5.0" condition="MAX32660 Family" >
            <description>System Startup for Maxim MAX32660 Microcontroller</description>
			
			
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/CMSIS/Device/Maxim/MAX32660/Include/" version="1.5.0" />
               <file category="include" name="Libraries/PeriphDrivers/Include/MAX32660/" version="1.5.0" />

			   <file category="include" name="Libraries/PeriphDrivers/Source/ADC/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/AES/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CRC/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CAMERAIF/" version="1.5.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2S/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/OWM/" version="1.5.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LPCMP/" version="1.5.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SEMA/" version="1.5.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SYS/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TRNG/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="1.5.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WUT/" version="1.5.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/PT/" version="1.5.0"/>

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->			   
               <file category="sourceAsm" attr="config" version="1.5.0" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/ARM/startup_max32660.s" condition="Startup ARM" />
                <file category="sourceC" attr="config"  version="1.5.0" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/IAR/low_level_init.c" condition="Startup IAR" />
				
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="1.5.0" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/GCC/startup_max32660.S" condition="Startup GCC" />

