vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32660.pdsc
               <!-- IAR device startup file, low level init and cmain.s -->  
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/IAR/startup_max32660.s" condition="Startup IAR" version="1.5.0" />
               <file category="sourceC" attr="config"  version="1.5.0" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="1.5.0" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/IAR/cmain.s" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="1.5.0" name="Libraries/CMSIS/Device/Maxim/MAX32660/Source/system_max32660.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.5.0" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32660/Include/max32660.h" version="1.5.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="1.5.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="1.5.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="1.5.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me11.c"  version="1.5.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me11.c"  version="1.5.0" />	   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="1.5.0" />		   
            </files>
         </component>
		 

         <component Cgroup="DMA" condition="MAX32660 CMSIS DMA" Cversion="1.5.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="1.5.0"/>
            </files>
         </component>

         <component Cgroup="Low Power" condition="MAX32660 CMSIS Low Power" Cversion="1.5.0">
            <description>Low Power demo</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me11.c" version="1.5.0"/>			   
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32660 CMSIS FLC" Cversion="1.5.0" >
            <description> Flash Controller </description>
            <files>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me11.c" version="1.5.0"/>			
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="1.5.0"/>		
			  <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_revb.c" version="1.5.0"/>	-->			   			   
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32660 CMSIS GPIO" Cversion="1.5.0">
            <description> GPIO </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="1.5.0"/>		   
            </files>
         </component>
		 
        <component Cgroup="I2C" condition="MAX32660 CMSIS I2C" Cversion="1.5.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="1.5.0"/>			   
            </files>
         </component>			 

         <component Cgroup="ICC" condition="MAX32660 CMSIS ICC" Cversion="1.5.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="1.5.0"/>			   
            </files>
         </component>		 

		 
         <component Cgroup="RTC" condition="MAX32660 CMSIS RTC" Cversion="1.5.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="1.5.0"/>			   
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32660 CMSIS SPI" Cversion="1.5.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me11.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="1.5.0"/>			   
            </files>
         </component>

         <component Cgroup="SPIMSS" condition="MAX32660 CMSIS SPIMSS" Cversion="1.5.0">
            <description>SPIMSS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIMSS/spimss_me11.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIMSS/spimss_reva.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIMSS/i2s_me11.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIMSS/i2s_reva.c" version="1.5.0"/>			   
            </files>
         </component>

         <component Cgroup="SYS" condition="MAX32660 CMSIS SYS" Cversion="1.5.0">
            <description>SYS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me11.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me11.c" version="1.5.0"/>
               <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_es17.c" version="1.5.0"/> -->				   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.5.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c" version="1.5.0"/>

            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32660 CMSIS TIMER" Cversion="1.5.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_reva.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="1.5.0"/>			   
            </files>
         </component>

         <component Cgroup="UART" condition="MAX32660 CMSIS UART" Cversion="1.5.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_reva.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="1.5.0"/>
            </files>
         </component>

         <component Cgroup="WDT" condition="MAX32660 CMSIS WDT" Cversion="1.5.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me11.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_reva.c" version="1.5.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="1.5.0"/>
            </files>
         </component>		 		 
		 
		 
      </bundle>
	  
	  
