vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32660.pdsc
       <!--            DELETE THIS...                                                              
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.5.0" versionMatchMode="fixed" condition="MAX32660 Family">
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32660   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
       </component>
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="1.5.0" condition="MAX32660 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32660   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component> -->	  
	  
	  
	 <!--  investigate Cversion --> 

      <bundle Cbundle="MAX32660 BSP" Cclass="BSP" Cversion="1.5.0">
         <description>MAX32660 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32660_EvKit.txt</doc>

            <component Cgroup="EvKit V1" condition="MAX32660 BSP DEP">
		    <!-- <component Cgroup="EvKit V1"> -->
            <description>MAX32660 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */			   
            </RTE_Components_h>
            <files>
			   <file category="include" name="Libraries/Boards/MAX32660/EvKit_V1/Include/" version="1.5.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32660/EvKit_V1/Source/board.c" version="1.5.0"/>	   			   
               <file category="include" name="Libraries/Boards/MAX32660/Include/" version="1.5.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32660/Source/led.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32660/Source/pb.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32660/Source/stdio.c" version="1.5.0"/>
               <file category="sourceC" name="Libraries/MiscDrivers/ExtMemory/mx25.c" version="1.5.0"/>
               <file category="include" name="Libraries/MiscDrivers/ExtMemory" version="1.5.0"/>			   
           </files>
         </component> 
      </bundle> 	  
	  

   </components>
</package>